app/Controllers/Customer.php

    public function takeATest()
    {
        $builder = $this->db->table('tblsurvey');
        $builder->select('surveyID');
        $builder->WHERE('Status',1);;
        $survey = $builder->get()->getResult();
---
SELECT `surveyID`
FROM `tblsurvey`
WHERE `Status` = 1