app/Controllers/Home.php

SELECT `a`.*, `b`.`Fullname`
FROM `tblblogs` `a`
LEFT JOIN `tblaccount` `b` ON `b`.`accountID`=`a`.`accountID`
ORDER BY `a`.`blogsID` DESC
 LIMIT 5
---
    public function createBlog()
    {
        //get the recent blogs at least 5
        $builder = $this->db->table('tblblogs a');
        $builder->select('a.*,b.Fullname');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $builder->orderBy('a.blogsID','DESC')->limit(5);
        $blog = $builder->get()->getResult();

SELECT `a`.`reservationID`, `a`.`Date`, `a`.`Time`, `a`.`Event_Name`, `a`.`Status`, `b`.`Fullname`
FROM `tblreservation` `a`
LEFT JOIN `tblcustomer` `b` ON `b`.`customerID`=`a`.`customerID`
WHERE `b`.`Fullname` LIKE '%%wa%%' ESCAPE '!'
GROUP BY `a`.`reservationID`
ORDER BY `a`.`reservationID` DESC
---
    public function Reservation()
    {
        $builder = $this->db->table('tblreservation a');
        $builder->select('a.reservationID,a.Date,a.Time,a.Event_Name,a.Status,b.Fullname');
        $builder->join('tblcustomer b','b.customerID=a.customerID','LEFT');
        $builder->groupBy('a.reservationID');
        $builder->orderBy('a.reservationID','DESC');
        $data = $builder->get();