app/Controllers/Home.php

SELECT `a`.*, `b`.`Fullname`
FROM `tblblogs` `a`
LEFT JOIN `tblaccount` `b` ON `b`.`accountID`=`a`.`accountID`
---
    public function index()
    {
        //doctors
        $doctorsModel = new \App\Models\doctorsModel();
        $doctors = $doctorsModel->findAll();
        //blogs
        $builder = $this->db->table('tblblogs a');
        $builder->select('a.*,b.Fullname');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $blog  = $builder->get()->getResult();

SELECT *
FROM `tblaccount`
---
    public function check()
    {
        date_default_timezone_set('Asia/Manila');
        $systemLogsModel = new \App\Models\systemLogsModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $validation = $this->validate([
            'email'=>'required|valid_email',
            'password'=>'min_length[8]|max_length[12]'
        ]);
        if(!$validation)
        {
            session()->setFlashdata('fail','Invalid Username or Password!');
            return redirect()->to('/auth')->withInput();
        }
        else
        {
            $builder = $this->db->table('tblaccount');
            $builder->select('*');
            $builder->WHERE('EmailAddress',$email)->WHERE('Status',1);
            $data = $builder->get();

SELECT *
FROM `tblaccount`
SELECT `a`.*, `b`.`Fullname`
FROM `tblblogs` `a`
LEFT JOIN `tblaccount` `b` ON `b`.`accountID`=`a`.`accountID`
SELECT *
FROM `tblsurvey`
SELECT `a`.*, `b`.`Title`, `b`.`Type_Survey`
FROM `tblquestion` `a`
LEFT JOIN `tblsurvey` `b` ON `b`.`surveyID`=`a`.`surveyID`
SELECT `a`.`Details`, `a`.`choiceID`, `b`.`Question`, `a`.`Score`
FROM `tblchoice` `a`
LEFT JOIN `tblquestion` `b` ON `b`.`questionID`=`a`.`questionID`
---
    public function Settings()
    {
        $accountModel = new \App\Models\accountModel();
        $user = $accountModel->findAll();
        //survey
        $surveyModel = new \App\Models\surveyModel();
        $survey = $surveyModel->findAll();
        //doctors
        $doctorsModel = new \App\Models\doctorsModel();
        $doctors = $doctorsModel->findAll();
        $builder = $this->db->table('tblblogs a');
        $builder->select('a.*,b.Fullname');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $blog  = $builder->get()->getResult();
        //question
        $builder = $this->db->table('tblquestion a');
        $builder->select('a.*,b.Title,b.Type_Survey');
        $builder->join('tblsurvey b','b.surveyID=a.surveyID','LEFT');
        $list = $builder->get()->getResult();
        //choices
        $builder = $this->db->table('tblchoice a');
        $builder->select('a.Details,a.choiceID,b.Question,a.Score');
        $builder->join('tblquestion b','b.questionID=a.questionID','LEFT');
        $choices = $builder->get()->getResult();