app/Controllers/Report.php

SELECT `Location`, COUNT(customerID)total
FROM `tblcustomerinfo`
WHERE `Date` >= '2024-04-01'
AND `Date` <= '2024-04-30'
GROUP BY `Location`
---
    public function generateLocation()
    {
        $fromdate = $this->request->getGet('fromdate');
        $todate = $this->request->getGet('todate');

        $builder = $this->db->table('tblcustomerinfo');
        $builder->select('Location,COUNT(customerID)total');
        $builder->WHERE('Date>=',$fromdate)->WHERE('Date<=',$todate);
        $builder->groupBy('Location');
        $data = $builder->get();

SELECT `Age` as `label`, COUNT(infoID)Total
FROM `tblcustomerinfo`
WHERE `Date` >= '2024-04-01'
AND `Date` <= '2024-04-30'
GROUP BY `Age`
---
    public function ageChart()
    {
        $fromdate = $this->request->getGet('fromdate');
        $todate = $this->request->getGet('todate');
        $dataPoints = array();
        $builder = $this->db->table("tblcustomerinfo");
        $builder->select('Age as label,COUNT(infoID)Total');
        $builder->WHERE('Date >=',$fromdate);
        $builder->WHERE('Date <=',$todate);
        $builder->groupby('Age');
        $data = $builder->get();