app/Views/customer/take-a-test.php

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 2'
---
                      $db;$this->db = db_connect();
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 1');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 3'
---
                    <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 2');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 4'
---
                    <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 3');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 5'
---
                    <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 4');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 6'
---
                      <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 5');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 7'
---
                    <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 6');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 8'
---
                    <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 7');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 9'
---
                    <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 8');

SELECT `Question`, `questionID`
FROM `tblquestion`
WHERE `surveyID` = '1'
AND `Sequence` = 'Question 10'
---
                    <?php
                      $builder = $this->db->table('tblquestion');
                      $builder->select('Question,questionID,Sequence');
                      $builder->WHERE('surveyID',$rows->surveyID)->WHERE('Sequence','Question 9');