app/Views/customer/take-a-test.php

SELECT `choiceID`, `Details`
FROM `tblchoice`
WHERE `questionID` = '2'
---
                      $db;$this->db = db_connect();
                      $builder = $this->db->table('tblchoice');
                      $builder->select('choiceID,Details');
                      $builder->WHERE('questionID',$row->questionID);